In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.__version__

'1.2.0'

In [2]:
import xlrd
import xlwt
import openpyxl

In [10]:
s = pd.Series(data = [100, 'a', {'dic1':5}],
              index = pd.Index(['id1', 20, 'third'], name='my_idx'),
              dtype = 'object',
              name = 'my_name')

In [11]:
s

my_idx
id1              100
20                 a
third    {'dic1': 5}
Name: my_name, dtype: object

In [3]:
df = pd.read_csv('data/learn_pandas.csv')
df.columns

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer',
       'Test_Number', 'Test_Date', 'Time_Record'],
      dtype='object')

In [4]:
df = df[df.columns[:7]]

In [14]:
df.columns

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer'], dtype='object')

In [15]:
df.head(2)

,School,Grade,Name,Gender,Height,Weight,Transfer
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N

In [16]:
df.tail()

,School,Grade,Name,Gender,Height,Weight,Transfer
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   School    200 non-null    object
 1   Grade     200 non-null    object
 2   Name      200 non-null    object
 3   Gender    200 non-null    object
 4   Height    183 non-null    float64
 5   Weight    189 non-null    float64
 6   Transfer  188 non-null    object
dtypes: float64(2), object(5)
memory usage: 11.1+ KB

In [18]:
df.describe()

           Height      Weight
count  183.000000  189.000000
mean   163.218033   55.015873
std      8.608879   12.824294
min    145.400000   34.000000
25%    157.150000   46.000000
50%    161.900000   51.000000
75%    167.500000   65.000000
max    193.900000   89.000000

In [19]:
a1,a2,a3,a4,a5,a6,a7 = df.sum(), df.mean(), df.median(), df.var(), df.std(), df.max(), df.min()

In [5]:
df_demo = df[['Height', 'Weight']]

In [26]:
b1,b2,b3 = df_demo.quantile(), df_demo.count(), df_demo.idxmax()

In [30]:
b1

Height    161.9
Weight     51.0
Name: 0.5, dtype: float64

In [28]:
b2

Height    183
Weight    189
dtype: int64

In [29]:
b3

Height    193
Weight      2
dtype: int64

In [31]:
df['School'].unique()

array(['Shanghai Jiao Tong University', 'Peking University',
       'Fudan University', 'Tsinghua University'], dtype=object)

In [32]:
df['School'].nunique()

4

In [33]:
df['School'].value_counts()

Tsinghua University              69
Shanghai Jiao Tong University    57
Fudan University                 40
Peking University                34
Name: School, dtype: int64

In [6]:
df['Gender'].head()

0    Female
1      Male
2      Male
3    Female
4      Male
Name: Gender, dtype: object

In [7]:
df['Gender'].replace({'Female':0, 'Male':1}).head()

0    0
1    1
2    1
3    0
4    1
Name: Gender, dtype: int64

In [9]:
s = pd.Series(['a', 1, 'b', 2, 1, 1, 'a'])
s1 = s.replace([1, 2], method='ffill')
s2 = s.replace([1, 2], method='bfill')
print(s1, s2)

0    a
1    a
2    b
3    b
4    b
5    b
6    a
dtype: object 0    a
1    b
2    b
3    a
4    a
5    a
6    a
dtype: object

In [11]:
s = pd.Series([-1, 1.2345, 100, -50])
s1 = s.where(s<0)
s2 = s.where(s<0, 100)
s3 = s.mask(s<0)
s4 = s.mask(s<0, -50)
s_condition= pd.Series([True,False,False,True],index=s.index)
s5 = s.mask(s_condition, -50)
print(s1, s2, s3, s4, s5)

0    -1.0
1     NaN
2     NaN
3   -50.0
dtype: float64 0     -1.0
1    100.0
2    100.0
3    -50.0
dtype: float64 0         NaN
1      1.2345
2    100.0000
3         NaN
dtype: float64 0    -50.0000
1      1.2345
2    100.0000
3    -50.0000
dtype: float64 0    -50.0000
1      1.2345
2    100.0000
3    -50.0000
dtype: float64

In [12]:
s = pd.Series([-1, 1.2345, 100, -50])
s1 = s.round(2)
s2 = s.abs()
s3 = s.clip(0, 2)                                            # 前两个数分别表示上下截断边界
print(s1, s2, s3)

0     -1.00
1      1.23
2    100.00
3    -50.00
dtype: float64 0      1.0000
1      1.2345
2    100.0000
3     50.0000
dtype: float64 0    0.0000
1    1.2345
2    2.0000
3    0.0000
dtype: float64

In [13]:
df_demo = df[['Grade', 'Name', 'Height',
              'Weight']].set_index(['Grade','Name'])

In [14]:
df_demo.sort_values('Height').head()

                         Height  Weight
Grade     Name
Junior    Xiaoli Chu      145.4    34.0
Senior    Gaomei Lv       147.3    34.0
Sophomore Peng Han        147.8    34.0
Senior    Changli Lv      148.7    41.0
Sophomore Changjuan You   150.5    40.0

In [15]:
df_demo.sort_values(['Weight','Height'],ascending=[True,False]).head()

                       Height  Weight
Grade     Name
Sophomore Peng Han      147.8    34.0
Senior    Gaomei Lv     147.3    34.0
Junior    Xiaoli Chu    145.4    34.0
Sophomore Qiang Zhou    150.5    36.0
Freshman  Yanqiang Xu   152.4    38.0

In [17]:
df_demo = df[['Height', 'Weight']]
def my_mean(x):
    res = x.mean()
    return res
df_demo.apply(my_mean)

Height    163.218033
Weight     55.015873
dtype: float64

In [18]:
s = pd.Series([1,2,3,4,5])
roller = s.rolling(window = 3)
r1 = roller.mean()
r2 = roller.sum()
print(r1, r2)

0    NaN
1    NaN
2    2.0
3    3.0
4    4.0
dtype: float64 0     NaN
1     NaN
2     6.0
3     9.0
4    12.0
dtype: float64

In [19]:
s2 = pd.Series([1,2,6,16,30])
rs1 = roller.cov(s2)
rs2 = roller.corr(s2)
print(rs1, rs2)

0     NaN
1     NaN
2     2.5
3     7.0
4    12.0
dtype: float64 0         NaN
1         NaN
2    0.944911
3    0.970725
4    0.995402
dtype: float64

In [20]:
s = pd.Series([1,3,6,10,15])
s1 = s.shift(2)
s2 = s.diff(3)
s3 = s.pct_change()
s4 = s.shift(-1)
s5 = s.diff(-2)
print(s1,s2,s3,s4,s5)

0    NaN
1    NaN
2    1.0
3    3.0
4    6.0
dtype: float64 0     NaN
1     NaN
2     NaN
3     9.0
4    12.0
dtype: float64 0         NaN
1    2.000000
2    1.000000
3    0.666667
4    0.500000
dtype: float64 0     3.0
1     6.0
2    10.0
3    15.0
4     NaN
dtype: float64 0   -5.0
1   -7.0
2   -9.0
3    NaN
4    NaN
dtype: float64

In [21]:
s = pd.Series([1, 3, 6, 10])
s_mean = s.expanding().mean()
print(s_mean)

0    1.000000
1    2.000000
2    3.333333
3    5.000000
dtype: float64